using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AutoChess
{
    /// <summary>
    /// 配置数据
    /// </summary>
    public class ConfigData
    {
        /// <summary>
        /// 所有羁绊
        /// </summary>
        public static string Addition { get; } = @"刺客,3,所有刺客10% 4倍伤害
刺客,6,所有刺客20% 4倍伤害
德鲁伊,2,2星可以2合1
德鲁伊,4,3星可以2合1
法师,3,对方所有魔抗-30
法师,6,对方所有魔抗-50
工匠,2,所有工匠恢复+10
工匠,4,所有工匠恢复+20
猎人,3,所有猎人攻击+25%
猎人,6,所有猎人攻击+35%
骑士,2,所有骑士25%概率减伤护盾
骑士,4,所有骑士35%概率减伤护盾
骑士,6,所有骑士45%概率减伤护盾
萨满,2,战斗开始变羊对方一单位6秒
术士,3,所有友方吸血15%
术士,6,所有友方吸血25%
矮人,1,自己攻击距离+300
地精,3,一个友方护甲+15 恢复+10
地精,6,所有地精护甲+15 恢复+10
精灵,2,所有精灵20%闪避
精灵,4,所有精灵20%闪避
精灵,6,所有精灵20%闪避
巨魔,2,所有巨魔攻速+30
巨魔,4,所有友方攻速+30
龙,3,所有龙初始魔法+100
娜迦,2,所有友方魔抗+20
娜迦,4,所有友方魔抗+40
人类,2,所有人类攻击20%缴械3秒
人类,4,所有人类攻击25%缴械3秒
人类,6,所有人类攻击30%缴械3秒
兽人,2,所有兽人最大生命值+250
兽人,4,所有兽人最大生命值+350
亡灵,2,对方所有护甲-5
亡灵,4,对方所有护甲-7
野兽,2,友方所有攻击+10%
野兽,4,友方所有攻击+10%
野兽,6,友方所有攻击+20%
元素,2,所有元素魔抗+30
食人魔,1,自己最大生命值+10%
恶魔猎手,1,敌方恶魔增加攻击力无效
恶魔,1,自己攻击+50%(一个恶魔有效)
战士,3,所有战士护甲+8
战士,6,所有战士护甲+10
";
        /// <summary>
        /// 所有羁绊
        /// </summary>
        public static string ChessPieces { get; } = @"黑暗游侠,亡灵,,猎人,1,远,
死骑,亡灵,,骑士,3,近,
死灵法师(NEC),亡灵,,术士,4,远,
巫妖,亡灵,,法师,5,远,
赏金,地精,,刺客,1,近,
发条,地精,,工匠,1,近,
修补匠,地精,,工匠,1,远,
伐木机,地精,,工匠,2,近,
炼金,地精,,术士,4,近,
地精工程师,地精,,工匠,5,远,
斧王,兽人,,战士,1,近,
兽王,兽人,,猎人,2,近,
剑圣,兽人,,战士,2,近,
干扰者,兽人,,萨满,4,近,
小鹿,野兽,,德鲁伊,1,远,
海民,野兽,,战士,1,近,
狼人,野兽,人类,战士,3,近,
剧毒术士,野兽,,术士,3,远,
沙王,野兽,,刺客,3,近,
熊德,野兽,,德鲁伊,4,近,
暗影萨满,巨魔,,萨满,1,远,
蝙蝠,巨魔,,骑士,1,远,
巫医,巨魔,,术士,2,远,
巨魔战将,巨魔,,战士,4,近,
女王,恶魔,,刺客,2,远,
混沌,恶魔,,骑士,2,近,
影魔,恶魔,,术士,3,远,
末日,恶魔,,战士,4,近,
狙击手,矮人,,猎人,3,远,
直升机,矮人,,工匠,5,远,
鱼人守卫,娜迦,,战士,2,近,
鱼人夜行者,娜迦,,刺客,3,近,
蛇女,娜迦,,猎人,4,远,
潮汐,娜迦,,猎人,5,近,
精灵龙,龙,精灵,法师,2,远,
冥界亚龙,龙,,刺客,3,远,
龙骑士,龙,人类,骑士,4,远,
冰女,人类,,法师,2,远,
全能,人类,,骑士,3,近,
火女,人类,,法师,3,远,
船长,人类,,战士,4,近,
光法,人类,,法师,4,远,
敌法,精灵,,恶魔猎手,1,近,
大树,精灵,,德鲁伊,2,近,
露娜,精灵,,骑士,2,远,
先知,精灵,,德鲁伊,2,远,
风行,精灵,,猎人,3,远,
幻影刺客(PA),精灵,,刺客,3,近,
圣堂(TA),精灵,,刺客,4,近,
幽魂,元素,,法师,3,远,
谜团,元素,,术士,5,远,
蓝胖,食人魔,,法师,1,近,
";
    }
}
